
## Plan Result

[CI link](https://github.com/hikobend/aws-sample-architecture-1/actions/runs/5634075172)


<pre><code>Plan: 17 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.network.module.network.aws_default_network_acl.this[0]
  * module.network.module.network.aws_default_route_table.default[0]
  * module.network.module.network.aws_default_security_group.this[0]
  * module.network.module.network.aws_internet_gateway.this[0]
  * module.network.module.network.aws_route.public_internet_gateway[0]
  * module.network.module.network.aws_route_table.private[0]
  * module.network.module.network.aws_route_table.private[1]
  * module.network.module.network.aws_route_table.public[0]
  * module.network.module.network.aws_route_table_association.private[0]
  * module.network.module.network.aws_route_table_association.private[1]
  * module.network.module.network.aws_route_table_association.public[0]
  * module.network.module.network.aws_route_table_association.public[1]
  * module.network.module.network.aws_subnet.private[0]
  * module.network.module.network.aws_subnet.private[1]
  * module.network.module.network.aws_subnet.public[0]
  * module.network.module.network.aws_subnet.public[1]
  * module.network.module.network.aws_vpc.this[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.network.module.network.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Name" = "-default"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "-default"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + egress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + ingress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
    }

  # module.network.module.network.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name" = "-default"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "-default"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.network.module.network.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "-default"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "-default"
        }
      + vpc_id                 = (known after apply)
    }

  # module.network.module.network.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "internet-gateway"
        }
      + tags_all = {
          + "Environment" = "dev"
          + "Name"        = "internet-gateway"
        }
      + vpc_id   = (known after apply)
    }

  # module.network.module.network.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.network.module.network.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "route-table-private"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Name"        = "route-table-private"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.module.network.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "route-table-private"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Name"        = "route-table-private"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.module.network.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "route-table-public"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "Name"        = "route-table-public"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.module.network.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.module.network.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.module.network.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.module.network.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.module.network.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.128/26"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "private-subnet-1a"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "private-subnet-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.module.network.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.192/26"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "private-subnet-1c"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "private-subnet-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.module.network.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/26"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "public-subnet-1a"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "public-subnet-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.module.network.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.64/26"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "public-subnet-1c"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "Name"        = "public-subnet-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.module.network.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/24"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "vpc"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "Name"        = "vpc"
        }
    }

Plan: 17 to add, 0 to change, 0 to destroy.
```

</details>



## :warning: Warnings :warning:

```hcl
Warning: Argument is deprecated

  with module.network.module.network.aws_eip.nat,
  on .terraform/modules/network.network/main.tf line 1030, in resource "aws_eip" "nat":
1030:   vpc = true

use domain attribute instead

```



<!-- github-comment: {"Command":"plan","JobName":"terraform_plan","PRNumber":30,"Program":"tfcmt","SHA1":"51ac6e165149926f9afe0e1a6430f1e7f5234dff","Vars":{},"WorkflowName":"dev plan"} -->